let resumeList = [
  {
    title: "上海文化大公有限公司 （2016.6-2018.11)",
    tips: [
      "职责:主要负责前端框架的搭建和主要业务的开发",
      "离职原因:总公司让杭州分部解散 ，所以线上作品都撤销了",
      "规模:上市（香港大公文化）"
    ],
    detailText: [
      {
        menuText: "Rice艺术家维权小程序",
        taskText:
          "是为艺术家维权而设计的。主要的功能模块有：入驻的艺术家的打卡记录自己作品的生成轨迹，分享自己的作品到朋友圈或者群，人，便于获取分数值，艺术家排行榜，编辑艺术品修改该艺术品的内容和图片，艺术家和粉丝有互动，留言等搭建mpvue小程序框架，封装常用代码让小伙伴一起用：apikey过期，请求接口加密签名等方法的封装，用canvas绘制分享的海报图和小程序码，动态设置分享图片内容标题。页面的上拉下拉分页效果，在数据量大的情况 安卓机会出现页面卡顿的情况，采用分屏展示模式，其他不可视区域列表数据用0 占位一个高度，让dom 元素小下去等技术，可以解决逻辑层到视图层的js阻塞，从而大大的提高了首屏的用户体验效果。"
      },
      {
        menuText: "Online 艺术品改版一期",
        taskText:
          "主要负责pc 端还有交易所的h5 页面实现交易所的和艺术品的相关买卖流程。负责原版迁移新版改版的需求实现，跟进网站后期维护"
      },
      {
        menuText: "艺术品交易信息-之区块链项目",
        taskText:
          "为上市发布的艺术品信息的相关股票信息进行展示。每一个艺术品都有对应的k线图，买入卖出成交量的展示等。负责公司主要业务开发，搭建express+gulp+webpack，构建MVC框架，负责公司之前的区块链开发主要开发部分，用Web3.js 的api 和以太坊的智能合约进行调用唤起安装在浏览器端的插件MetaMask钱包,运用websoket实现页面股票信息的实时更新，Kline插件进去股票分时图等的绘制。"
      }
    ]
  },
  {
    title: "杭州华盛达金融控股有限公司（2015.9-2016.6）",
    tips: [
      "职责:主要pc端业务的开发 和 部分h5页面",
      "离职原因:公司搬家 ，搬到比较远的地方",
      "规模:500+人"
    ],
    detailText: [
      {
        menuText: "集采-金融理财买卖网站",
        taskText:
          "市面上常见的理财买卖网站模块的实现。由于今年p2p 金融理财类型公司很多都暴雷了 ，所以线上作品 https://www.jicai.com/ 看运气了能不能打开 ，基本上这个网站的动态和静态效果都由我一个人完成。微信上搜索公众号集财，方便的话关注一下，里面的很多h5活动页面我这边负责的，确保了每一次活动的顺利进行和上线"
      }
    ]
  },
  {
    title: "杭州妙蓝软件有限公司（2015.6-2015.9）",
    tips: [
      "职责:负责静态页面编写",
      "离职原因:学不到东西"
    ],
  },
]
export {resumeList}
